<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introduction</a></span></li><li><span><a href="#Installation" data-toc-modified-id="Installation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Installation</a></span></li><li><span><a href="#Introduction-to-pandas-data-structures" data-toc-modified-id="Introduction-to-pandas-data-structures-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introduction to pandas data structures</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#Find-NaN-values" data-toc-modified-id="Find-NaN-values-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Find NaN values</a></span></li></ul></li><li><span><a href="#Read/write-data" data-toc-modified-id="Read/write-data-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Read/write data</a></span><ul class="toc-item"><li><span><a href="#We-load-data-in-CSV-format" data-toc-modified-id="We-load-data-in-CSV-format-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>We load data in CSV format</a></span></li><li><span><a href="#We-load-data-in-xlsx-format" data-toc-modified-id="We-load-data-in-xlsx-format-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>We load data in xlsx format</a></span></li><li><span><a href="#We-display-the-first-rows" data-toc-modified-id="We-display-the-first-rows-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>We display the first rows</a></span></li><li><span><a href="#We-display-the-last-rows" data-toc-modified-id="We-display-the-last-rows-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>We display the last rows</a></span></li><li><span><a href="#Visualize-a-random-sample" data-toc-modified-id="Visualize-a-random-sample-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Visualize a random sample</a></span></li></ul></li><li><span><a href="#Exploratory-analysis-of-a-dataframe" data-toc-modified-id="Exploratory-analysis-of-a-dataframe-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Exploratory analysis of a dataframe</a></span></li><li><span><a href="#Basic-operations-with-dataframes" data-toc-modified-id="Basic-operations-with-dataframes-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Basic operations with dataframes</a></span><ul class="toc-item"><li><span><a href="#We-select-a-column" data-toc-modified-id="We-select-a-column-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>We select a column</a></span></li><li><span><a href="#We-select-several-columns" data-toc-modified-id="We-select-several-columns-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>We select several columns</a></span></li><li><span><a href="#Get-the-unique-values-​​of-a-column-(ie-a-Series)" data-toc-modified-id="Get-the-unique-values-​​of-a-column-(ie-a-Series)-6.3"><span class="toc-item-num">6.3&nbsp;&nbsp;</span>Get the unique values ​​of a column (ie a Series)</a></span></li><li><span><a href="#Change-the-data-type-of-a-column" data-toc-modified-id="Change-the-data-type-of-a-column-6.4"><span class="toc-item-num">6.4&nbsp;&nbsp;</span>Change the data type of a column</a></span></li><li><span><a href="#We-filter-the-data-by-the-value-of-the-columns" data-toc-modified-id="We-filter-the-data-by-the-value-of-the-columns-6.5"><span class="toc-item-num">6.5&nbsp;&nbsp;</span>We filter the data by the value of the columns</a></span></li><li><span><a href="#Copy-a-dataframe-and-rename-columns" data-toc-modified-id="Copy-a-dataframe-and-rename-columns-6.6"><span class="toc-item-num">6.6&nbsp;&nbsp;</span>Copy a dataframe and rename columns</a></span><ul class="toc-item"><li><span><a href="#Rename-columns" data-toc-modified-id="Rename-columns-6.6.1"><span class="toc-item-num">6.6.1&nbsp;&nbsp;</span>Rename columns</a></span></li><li><span><a href="#We-can-rename-the-columns-by-crushing-the-instance-attribute...-does-this-ring-a-bell?" data-toc-modified-id="We-can-rename-the-columns-by-crushing-the-instance-attribute...-does-this-ring-a-bell?-6.6.2"><span class="toc-item-num">6.6.2&nbsp;&nbsp;</span>We can rename the columns by crushing the instance attribute... does this ring a bell?</a></span></li></ul></li><li><span><a href="#delete-columns" data-toc-modified-id="delete-columns-6.7"><span class="toc-item-num">6.7&nbsp;&nbsp;</span>delete columns</a></span></li><li><span><a href="#delete-rows" data-toc-modified-id="delete-rows-6.8"><span class="toc-item-num">6.8&nbsp;&nbsp;</span>delete rows</a></span></li><li><span><a href="#Reset_index-and-set_index" data-toc-modified-id="Reset_index-and-set_index-6.9"><span class="toc-item-num">6.9&nbsp;&nbsp;</span>Reset_index and set_index</a></span><ul class="toc-item"><li><span><a href="#SET_INDEX" data-toc-modified-id="SET_INDEX-6.9.1"><span class="toc-item-num">6.9.1&nbsp;&nbsp;</span>SET_INDEX</a></span></li></ul></li><li><span><a href="#Operations-between-columns" data-toc-modified-id="Operations-between-columns-6.10"><span class="toc-item-num">6.10&nbsp;&nbsp;</span>Operations between columns</a></span></li></ul></li><li><span><a href="#Apply-!" data-toc-modified-id="Apply-!-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Apply !</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Passing-a-map-or-an-apply" data-toc-modified-id="Passing-a-map-or-an-apply-7.0.1"><span class="toc-item-num">7.0.1&nbsp;&nbsp;</span>Passing a map or an apply</a></span></li><li><span><a href="#Receive:" data-toc-modified-id="Receive:-7.0.2"><span class="toc-item-num">7.0.2&nbsp;&nbsp;</span>Receive:</a></span></li></ul></li></ul></li><li><span><a href="#Df-.loc-&amp;-.iloc" data-toc-modified-id="Df-.loc-&amp;-.iloc-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Df .loc &amp; .iloc</a></span><ul class="toc-item"><li><span><a href="#Select-rows-and-columns-in-Pandas-by-position-with-iloc" data-toc-modified-id="Select-rows-and-columns-in-Pandas-by-position-with-iloc-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Select rows and columns in Pandas by position with iloc</a></span></li><li><span><a href="#Select-rows-and-columns-in-Pandas-based-on-labels-with-loc" data-toc-modified-id="Select-rows-and-columns-in-Pandas-based-on-labels-with-loc-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>Select rows and columns in Pandas based on labels with loc</a></span><ul class="toc-item"><li><span><a href="#Based-on-label" data-toc-modified-id="Based-on-label-8.2.1"><span class="toc-item-num">8.2.1&nbsp;&nbsp;</span>Based on label</a></span></li></ul></li></ul></li><li><span><a href="#Order-a-dataframe" data-toc-modified-id="Order-a-dataframe-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Order a dataframe</a></span><ul class="toc-item"><li><span><a href="#Look-for-null-values" data-toc-modified-id="Look-for-null-values-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>Look for null values</a></span><ul class="toc-item"><li><span><a href="#It-is-null?" data-toc-modified-id="It-is-null?-9.1.1"><span class="toc-item-num">9.1.1&nbsp;&nbsp;</span>It is null?</a></span></li><li><span><a href="#Is-NOT-null?" data-toc-modified-id="Is-NOT-null?-9.1.2"><span class="toc-item-num">9.1.2&nbsp;&nbsp;</span>Is NOT null?</a></span></li><li><span><a href="#Sum-the-null-values-​​of-each-column" data-toc-modified-id="Sum-the-null-values-​​of-each-column-9.1.3"><span class="toc-item-num">9.1.3&nbsp;&nbsp;</span>Sum the null values ​​of each column</a></span></li></ul></li><li><span><a href="#delete-null-values" data-toc-modified-id="delete-null-values-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>delete null values</a></span></li><li><span><a href="#How-to-fill-in-the-missing-data" data-toc-modified-id="How-to-fill-in-the-missing-data-9.3"><span class="toc-item-num">9.3&nbsp;&nbsp;</span>How to fill in the missing data</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#CATEGORIES-IN-DATAFRAME:-DOCUMENTATION" data-toc-modified-id="CATEGORIES-IN-DATAFRAME:-DOCUMENTATION-9.3.0.1"><span class="toc-item-num">9.3.0.1&nbsp;&nbsp;</span>CATEGORIES IN DATAFRAME: DOCUMENTATION</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#We-delete-the-duplicates" data-toc-modified-id="We-delete-the-duplicates-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>We delete the duplicates</a></span></li><li><span><a href="#Data-aggregation" data-toc-modified-id="Data-aggregation-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Data aggregation</a></span><ul class="toc-item"><li><span><a href="#GroupBy-&amp;-pivot_table" data-toc-modified-id="GroupBy-&amp;-pivot_table-11.1"><span class="toc-item-num">11.1&nbsp;&nbsp;</span>GroupBy &amp; pivot_table</a></span></li><li><span><a href="#Union-of-Dataframes" data-toc-modified-id="Union-of-Dataframes-11.2"><span class="toc-item-num">11.2&nbsp;&nbsp;</span>Union of Dataframes</a></span></li><li><span><a href="#Concat" data-toc-modified-id="Concat-11.3"><span class="toc-item-num">11.3&nbsp;&nbsp;</span>Concat</a></span><ul class="toc-item"><li><span><a href="#Concatenating-on-axis-0-(rows)" data-toc-modified-id="Concatenating-on-axis-0-(rows)-11.3.1"><span class="toc-item-num">11.3.1&nbsp;&nbsp;</span>Concatenating on axis 0 (rows)</a></span></li><li><span><a href="#Concatenating-on-axis-1-(columns)" data-toc-modified-id="Concatenating-on-axis-1-(columns)-11.3.2"><span class="toc-item-num">11.3.2&nbsp;&nbsp;</span>Concatenating on axis 1 (columns)</a></span></li></ul></li><li><span><a href="#Merge" data-toc-modified-id="Merge-11.4"><span class="toc-item-num">11.4&nbsp;&nbsp;</span>Merge</a></span><ul class="toc-item"><li><span><a href="#LEFT-Merge" data-toc-modified-id="LEFT-Merge-11.4.1"><span class="toc-item-num">11.4.1&nbsp;&nbsp;</span>LEFT Merge</a></span></li><li><span><a href="#RIGHT-Merge" data-toc-modified-id="RIGHT-Merge-11.4.2"><span class="toc-item-num">11.4.2&nbsp;&nbsp;</span>RIGHT Merge</a></span></li><li><span><a href="#INNER-Merge" data-toc-modified-id="INNER-Merge-11.4.3"><span class="toc-item-num">11.4.3&nbsp;&nbsp;</span>INNER Merge</a></span></li><li><span><a href="#OUTER-Merge" data-toc-modified-id="OUTER-Merge-11.4.4"><span class="toc-item-num">11.4.4&nbsp;&nbsp;</span>OUTER Merge</a></span></li></ul></li><li><span><a href="#Join" data-toc-modified-id="Join-11.5"><span class="toc-item-num">11.5&nbsp;&nbsp;</span>Join</a></span></li><li><span><a href="#Differences-between-join-&amp;-merge" data-toc-modified-id="Differences-between-join-&amp;-merge-11.6"><span class="toc-item-num">11.6&nbsp;&nbsp;</span>Differences between join &amp; merge</a></span></li></ul></li><li><span><a href="#Export-data" data-toc-modified-id="Export-data-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Export data</a></span></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Mega-recap" data-toc-modified-id="Mega-recap-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>Mega-recap</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#BASIC-CONCEPTS" data-toc-modified-id="BASIC-CONCEPTS-14.0.1"><span class="toc-item-num">14.0.1&nbsp;&nbsp;</span>BASIC CONCEPTS</a></span></li><li><span><a href="#VISUALIZE-I:-EXPLORE-DATASET" data-toc-modified-id="VISUALIZE-I:-EXPLORE-DATASET-14.0.2"><span class="toc-item-num">14.0.2&nbsp;&nbsp;</span>VISUALIZE I: EXPLORE DATASET</a></span></li><li><span><a href="#CHANGING-THE-DATASET" data-toc-modified-id="CHANGING-THE-DATASET-14.0.3"><span class="toc-item-num">14.0.3&nbsp;&nbsp;</span>CHANGING THE DATASET</a></span></li><li><span><a href="#HANDLING-MISSING-VALUES-&amp;-DUPLICATES" data-toc-modified-id="HANDLING-MISSING-VALUES-&amp;-DUPLICATES-14.0.4"><span class="toc-item-num">14.0.4&nbsp;&nbsp;</span>HANDLING MISSING VALUES &amp; DUPLICATES</a></span></li><li><span><a href="#VISUALIZE-II:-SELECTING-&amp;-ORDERING" data-toc-modified-id="VISUALIZE-II:-SELECTING-&amp;-ORDERING-14.0.5"><span class="toc-item-num">14.0.5&nbsp;&nbsp;</span>VISUALIZE II: SELECTING &amp; ORDERING</a></span></li><li><span><a href="#VISUALIZE-III:-GROUPBY,-AGGREGATIONS" data-toc-modified-id="VISUALIZE-III:-GROUPBY,-AGGREGATIONS-14.0.6"><span class="toc-item-num">14.0.6&nbsp;&nbsp;</span>VISUALIZE III: GROUPBY, AGGREGATIONS</a></span></li><li><span><a href="#AUGMENTING-DATA:-CONCAT,-MERGE-&amp;-JOIN" data-toc-modified-id="AUGMENTING-DATA:-CONCAT,-MERGE-&amp;-JOIN-14.0.7"><span class="toc-item-num">14.0.7&nbsp;&nbsp;</span>AUGMENTING DATA: CONCAT, MERGE &amp; JOIN</a></span></li></ul></li></ul></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

# Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

## Introduction
Pandas is undoubtedly the most widely used library in the Python ecosystem for data manipulation and analysis. It's fast, powerful, flexible, easy to use and open source.


Among its main features:

- A fast and efficient **DataFrame** object for data manipulation with built-in indexing* 

- **Reading and writing** of data in many formats: Microsoft Excel, CSV, SQL databases, etc;

- Integrated and efficient methods for all types of data manipulation: missing data, subset, union, merge, etc;

- Ease of working with temporary data (in fact, Pandas is named after "PANnel DAta")

- Good **integration with other data analysis or Machine learning libraries**: scikit-learn, scipy, seaborn, plotly, etc;

- It is **widely used** in both the private and academic sectors


Pandas provides high-level data structures and functions designed to make working with structured or tabular data fast, easy, and expressive. Since its introduction in 2010, it has helped make Python a powerful and productive data analysis environment. The main pandas objects that will be used in this book are the DataFrame, a column-oriented tabular data structure with row and column labels, and the Series, a labeled one-dimensional array object.

Pandas combines the high performance ideas of NumPy with the flexible data manipulation capabilities of spreadsheets and relational databases (such as SQL). It provides sophisticated indexing functionality to make it easy to reshape, slice and dice, perform aggregations, and select subsets of data.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Source: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

## Installation

The first thing you should do will always be
`pip install pandas`, `conda install pandas`

In [ ]:
# anaconda
    # enviroments: ironhack
    #pandas
    
# miniconda
    # conda activate ironhack
    #pip install pandas

In [3]:
import pandas as pd

## Introduction to pandas data structures
To get started with pandas, you'll need to get comfortable with its two working data structures: Series and DataFrame. Although they are not a universal solution to all problems, they provide a solid and easy-to-use foundation for most applications.

### Series
A Serie is a one-dimensional array object containing a sequence of values ​​(of NumPy-like types) and an associated array of data labels, called its index. The simplest Series is formed from a single array of data:

In [4]:
my_serie = pd.Series([1, 2, 3, "a string", 4, 5])
my_serie

0           1
1           2
2           3
3    a string
4           4
5           5
dtype: object

In [7]:
random_list = [1, 2, 3, "a string", 4, 5]
random_list[3]

'a string'

In [8]:
type(my_serie)

pandas.core.series.Series

In [11]:
my_serie.values

array([1, 2, 3, 'a string', 4, 5], dtype=object)

In [12]:
my_serie.index

RangeIndex(start=0, stop=6, step=1)

The string representation of a Series displayed interactively shows the index on the left and the values ​​on the right. Since we didn't specify an index for the data, a default one consisting of the integers 0 to N - 1 (where N is the length of the data) is created. You can get the array representation and the index object of the Series through its values ​​and index attributes, respectively:

Another way to think of a Series is as a fixed-length ordered dict, since it is a mapping of index values ​​to data values. It can be used in many contexts where a dictionary could be used.
If you have data contained in a Python dict, you can create a Series from it by passing the dict:

In [13]:
somedata = {
    "Ohio": 20000,
    "Texas": 2020,
    "Oregon":444, 
    "Utah":19019, 
    "Something else": 5959
}

In [15]:
somedata.keys()

dict_keys(['Ohio', 'Texas', 'Oregon', 'Utah', 'Something else'])

In [18]:
somedata.values()

dict_values([20000, 2020, 444, 19019, 5959])

In [14]:
somedata

{'Ohio': 20000,
 'Texas': 2020,
 'Oregon': 444,
 'Utah': 19019,
 'Something else': 5959}

In [20]:
my_serie

0           1
1           2
2           3
3    a string
4           4
5           5
dtype: object

In [19]:
somedata_series = pd.Series(somedata)
somedata_series

Ohio              20000
Texas              2020
Oregon              444
Utah              19019
Something else     5959
dtype: int64

In [21]:
states = ["California", "Ohio", "Oregon", "Texas", "Something else"]

In [23]:
somedata_series = pd.Series(somedata, index = states)
somedata_series

California            NaN
Ohio              20000.0
Oregon              444.0
Texas              2020.0
Something else     5959.0
dtype: float64

In [26]:
type(somedata_series["Ohio"])

numpy.float64

In [ ]:
type(somedata_series["California"])

In [32]:
# Exlore an object (a Series) and check how much information you don't have
# How many missing values I have

pd.isnull(somedata_series).sum()

1

When only one dict is passed, the resulting String index will have the keys of the dict in order. You can override this by passing the keys of the dict in the order you want them to appear in the resulting String:

Here, the three values ​​found in sdata were placed in the appropriate places, but since no value was found for 'California', it appears as NaN (not a number), which is considered in pandas to mark missing values ​​or NA. Since "Utah" was not included in the states, it is excluded from the resulting object.

### Find NaN values
NaN stands for Not A Number and is one of the common ways to represent the missing value in the data. It is a special floating point value and cannot be converted to a type other than float.
The NaN value is one of the main problems in data analysis. It is very essential to deal with NaN to get the desired results.

In [ ]:
#NaN: NotaNumber -> float
#NaN: missing values

In [31]:
pd.isnull(somedata_series)

California         True
Ohio              False
Oregon            False
Texas             False
Something else    False
dtype: bool

In [29]:
pd.isna(somedata_series)

California         True
Ohio              False
Oregon            False
Texas             False
Something else    False
dtype: bool

## Read/write data

Pandas can read and write data from a wide variety of formats. [Read the documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Although one of the most common is from a dict of lists of equal length or NumPy arrays:

In [35]:
import numpy as np

In [36]:
data = {
    "state": ["Ohio", "texas", "nevada", "michigan"],
    "year": [1990, 2000, 2001, 2005],
    "something": [1.5, "sds", 2223, np.nan]
}

In [43]:
df = pd.DataFrame(data)
df

      state  year something
0      Ohio  1990       1.5
1     texas  2000       sds
2    nevada  2001      2223
3  michigan  2005       NaN

In [46]:
#display(df)

If I create a dataframe through a list of dictionaries:
- Each dictionary will be a row
- The keys will be the names of the columns
- They have to have the same structure

In [54]:
df = pd.read_csv("../datasets/Advertising.csv")
df

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [ ]:
# sep=';'

Since we are using Jupyter Notebook, pandas DataFrame objects will be displayed as a more browser-friendly HTML table.

### We load data in CSV format

### We load data in xlsx format

### We display the first rows

In [ ]:
# bash file head -2
# bash file tail -10

In [57]:
df.head(3)

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3

In [56]:
df.tail()

        TV  Radio  Newspaper  Sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [76]:
df.sample(frac=0.8)

        TV  Radio  Newspaper  Sales
80    76.4   26.7       22.3   11.8
124  229.5   32.3       74.2   19.7
44    25.1   25.7       43.3    8.5
100  222.4    4.3       49.8   11.7
109  255.4   26.9        5.5   19.8
..     ...    ...        ...    ...
163  163.5   36.8        7.4   18.0
27   240.1   16.7       22.9   15.9
103  187.9   17.2       17.9   14.7
39   228.0   37.7       32.0   21.5
113  209.6   20.6       10.7   15.9

[160 rows x 4 columns]

In [80]:
display(df)

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

By default head shows me the first 5 rows, I can see some more or less by passing a number as a parameter

### We display the last rows

Exactly the same as with .head() we pass a parameter to .tail()

### Visualize a random sample

## Exploratory analysis of a dataframe

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   Radio      200 non-null    float64
 2   Newspaper  200 non-null    float64
 3   Sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [86]:
df.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

In [111]:
df["Sales"].value_counts()

9.7     5
12.9    4
11.7    4
15.9    4
25.4    3
       ..
15.7    1
14.2    1
11.2    1
19.4    1
18.5    1
Name: Sales, Length: 121, dtype: int64

In [82]:
df.sample()

       TV  Radio  Newspaper  Sales
90  134.3    4.9        9.3   11.2

In [83]:
df.shape

(200, 4)

In [85]:
list(df.columns)

['TV', 'Radio', 'Newspaper', 'Sales']

In [88]:
df["TV"].max()

296.4

In [90]:
#arr_1.mean()
df["TV"].mean()

147.0425

In [108]:
df["Sales"].sum()# as if it was a dictionary

2804.5

In [103]:
df["Sales"].sum()

SyntaxError: invalid character in identifier (3556919534.py, line 1)

In [98]:
df.Sales.sum() #as the attribute

2804.5

In [109]:
# If we have special characters -> we use df["Special CharacterS!"]

## Basic operations with dataframes

### We select a column

In [112]:
df["Sales"]

0      22.1
1      10.4
2       9.3
3      18.5
4      12.9
       ...
195     7.6
196     9.7
197    12.8
198    25.5
199    13.4
Name: Sales, Length: 200, dtype: float64

In [115]:
df.sample()

      TV  Radio  Newspaper  Sales
16  67.8   36.6      114.0   12.5

### We select several columns

In [117]:
# Subset of a dataframe
# By passing a list of columns to the df
df_2 = df[["Sales", "TV"]]
df_2

     Sales     TV
0     22.1  230.1
1     10.4   44.5
2      9.3   17.2
3     18.5  151.5
4     12.9  180.8
..     ...    ...
195    7.6   38.2
196    9.7   94.2
197   12.8  177.0
198   25.5  283.6
199   13.4  232.1

[200 rows x 2 columns]

In [ ]:
df = pd.read_csv(path)

In [121]:
df_2 = df[["TV", "Sales"]]
df_2.sample()

        TV  Sales
101  296.4   23.8

In [122]:
df_2.to_csv("../datasets/dummy.csv")

### Get the unique values ​​of a column (ie a Series)

In [125]:
df_3 = pd.read_csv("../datasets/avocado_kaggle.csv")
df_3

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [126]:
df_3["region"].unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

In [127]:
df_3.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

In [129]:
df_3.type.value_counts()

conventional    9126
organic         9123
Name: type, dtype: int64

# RECAP

- pandas is a library
- helps oprganize data
    - tabular data: rows & columns
    - dataframes: 2D arrays
    - dataframes & series
        - series: 1D arrays: values and index
        - just like a dictionary has keys and values
        - dataframe is an object that is the whole table
- we can preview
    - df.sample()
    - df.head() and df.tail()
    - df.info(), df.describe(), df.dtypes
    
    - df.column.value_counts()
    - df.column.unique()
    
    - Operations: sum, max, min, mean, std, 
    
- subsets: just some columns
- read and export from csv files: changes in jupyter notebook do not change the actual file in your computer
- check null values
    - type(NaN): float
    - NaN: missing value

In [134]:
# My first filter

boston_condition = df_3["region"] == "Boston"

boston_dataset = df_3[boston_condition]
boston_dataset

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
208,0,2015-12-27,1.13,450816.39,3886.27,346964.70,13952.56,86012.86,85913.60,99.26,0.0,conventional,2015,Boston
209,1,2015-12-20,1.07,489802.88,4912.37,390100.99,5887.72,88901.80,88768.47,133.33,0.0,conventional,2015,Boston
210,2,2015-12-13,1.01,549945.76,4641.02,455362.38,219.40,89722.96,89523.38,199.58,0.0,conventional,2015,Boston
211,3,2015-12-06,1.02,488679.31,5126.32,407520.22,142.99,75889.78,75666.22,223.56,0.0,conventional,2015,Boston
212,4,2015-11-29,1.19,350559.81,3609.25,272719.08,105.86,74125.62,73864.52,261.10,0.0,conventional,2015,Boston
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17656,7,2018-02-04,1.83,28934.01,9.14,2504.27,3.66,26416.94,20660.94,5756.00,0.0,organic,2018,Boston
17657,8,2018-01-28,1.72,30846.35,14.65,1628.45,0.00,29203.25,27876.23,1327.02,0.0,organic,2018,Boston
17658,9,2018-01-21,1.82,26704.98,60.87,2647.48,0.00,23996.63,21985.03,2011.60,0.0,organic,2018,Boston
17659,10,2018-01-14,1.73,29468.36,12.77,2380.23,0.00,27075.36,23926.76,3148.60,0.0,organic,2018,Boston
17660,11,2018-01-07,1.91,30096.00,14.46,2704.48,0.00,27377.06,25121.53,2255.53,0.0,organic,2018,Boston

In [135]:
boston_dataset.region.unique()

array(['Boston'], dtype=object)

In [136]:
df_3.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

### Change the data type of a column

### We filter the data by the value of the columns

### Copy a dataframe and rename columns

#### Rename columns
To rename columns we need a dictionary

The rename method allows me to rename only the columns that I want, the ones that are in the dictionary. No need to rename all at once

#### We can rename the columns by crushing the instance attribute... does this ring a bell?
Requires a list with the same number of columns

### delete columns

### delete rows

Rows can also be deleted. Note that the indexes are not reset. The index is associated with the row, not the order.
Can the index be restarted? Correct

### Reset_index and set_index

We read the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) to understand some parameters

#### SET_INDEX

What can we use to have the date as an index?
We will see it later, to analyze temporary series

### Operations between columns

## Apply !

Applies a function along an axis of the DataFrame.
[Read the docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

When I do an apply on a column, even though I use a lambda, I don't put axis because in the case below, what I'm doing is modifying a column, I use lambda to tell the apply that the first argument is a string that comes from outside and the second argument is the dataframe's own record.

The same way map receives a function and something it iteraves over
A DF is composed of numpy.arrays. So it's an iterable


#### Passing a map or an apply
- map -> function, iterable
- apply -> function, iterable


#### Receive:

- apply & user-defined function -> apply(function) "x", a value
- apply & lambda -> lambda row: row["column"]

## Df .loc & .iloc

### Select rows and columns in Pandas by position with iloc

loc syntax with multiple conditions
```python
df.loc[(df["column"] condition) & (df["column"] condition)]
````

The iloc method is used on DataFrames to select elements based on their location. Its syntax is data.iloc[<filas>, <columnas>], where <filas> and <columnas> are the position of the rows and columns that you want to select in the order that they appear in the object. A familiar notation for Matlab users. In a DataFrame, each of the rows has a number that goes from 0 to the total number of rows minus one. Being iloc the method that allows selecting the data based on these numbers. The same applies to columns.

In iloc there are two arguments rows and columns. In case the second is omitted, all columns in the row will be selected. So to select different rows can be used.

### Select rows and columns in Pandas based on labels with loc
The loc method can be used in two different ways: select rows or columns based on a label, or select rows or columns based on a condition.

#### Based on label

## Order a dataframe

Same operation, but give me only concrete columns

### Look for null values

#### It is null?

#### Is NOT null?

#### Sum the null values ​​of each column

### delete null values
There are several ways to do this, we take into account the "how" parameter and of course [the docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html).

REMEMBER THAT INPLACE TRUE IS FOR THE METHOD TO ACTION ON THE DF, IF NOT, I HAVE TO SAVE IT IN A NEW VARIABLE

With "any" (parameter that comes by default so be careful not to put anything) all the records in which there is a NaN in any column are deleted

### How to fill in the missing data

How about a little [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html)?

##### CATEGORIES IN DATAFRAME: DOCUMENTATION
https://runebook.dev/en/docs/pandas/user_guide/categorical

## We delete the duplicates

[Read the docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.duplicated.html)

## Data aggregation
### GroupBy & pivot_table
Pandas GroupBy is a powerful and versatile function in Python. It allows us to split your data into separate groups to perform calculations for better analysis.
A DataFrame can be grouped on its rows (axis=0) or on its columns (axis=1). Once this is done, a function is applied to each group, producing a new value. Finally, the results of all those function applications are combined into a result object. The shape of the resulting object will usually depend on what is done with the data.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

Suppose we want to calculate the mean of column data1 using the labels of key1. There are several ways to do it. One is to access data1 and call groupby with the column (a String) in key1.
The data (a Series) has been aggregated based on the group key, producing a new String that is now indexed by the unique values ​​of the key1 column. The resulting index has the name 'key1' because the DataFrame column `df['key1']` did.

`CUANTITATIVE.groupby(CATEGORICAL).calculation()`

Another way to groupby with agg syntax
https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html

- mean
- sum
-count

### Union of Dataframes
- https://realpython.com/pandas-merge-join-and-concat/
- https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html


### Concat
We join dataframes along axis 0 one below the other. Align columns by label.

#### Concatenating on axis 0 (rows)

#### Concatenating on axis 1 (columns)

### Merge

[Merge()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html) is most useful when you want to merge rows that share data.

#### LEFT Merge

#### RIGHT Merge

#### INNER Merge

#### OUTER Merge

### Join
The join, unlike the merge, will join the dataframes and where there are no records in the "index" it will put NaN

### Differences between join & merge

<figure class="wp-block-table is-style-stripes"><table class="has-fixed-layout"><thead><tr><th><strong>Join Feature</strong></th><th class="has-text-align-center" data-align="center"><strong>join()</strong></th><th class="has-text-align-center" data-align="center"><strong>merge()</strong></th></tr></thead><tbody><tr><td>inner</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>left</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>right</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>outer</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>cross</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Indices</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Columns</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on column, right on index</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on index, right on column</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr></tbody></table><figcaption>pandas join vs merge</figcaption></figure>

## Export data

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.info(memory_usage='deep')
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ​​of a column
df.col.unique() # returns unique values ​​from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Mega-recap
It's your turn, what have we learned today?

![sql joins](https://upload.wikimedia.org/wikipedia/commons/9/9d/SQL_Joins.svg)

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)